SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_smartcard.c
/*!
    \file    gd32e23x_hal_smartcard.c
    \brief   SMARTCARD driver
    
    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x_hal.h"

/* smartcard private function */
static FlagStatus _smartcard_error_flag_get(hal_smartcard_dev_struct *smartcard);
static void _smartcard_transmit_complete_interrupt(void *smartcard);
static void _smartcard_transmit_interrupt(void *smartcard);
static void _smartcard_receive_interrupt(void *smartcard);
static void _smartcard_transmit_dma(void *dma);
static void _smartcard_receive_dma(void *dma);
static void _smartcard_dma_error(void *dma);

/*!
    \brief      initialize the smartcard structure with the default values
    \param[in]  hal_struct_type: smartcard structure type
      \arg        HAL_SMARTCARD_INIT_STRUCT: initialization structure
      \arg        HAL_SMARTCARD_INIT_EX_STRUCT: initialization extend structure
      \arg        HAL_SMARTCARD_DEV_STRUCT: device information structure
      \arg        HAL_SMARTCARD_USER_CALLBCAK_STRUCT: user callback structure
      \arg        HAL_SMARTCARD_IRQ_INIT_STRUCT: interrupt callback initialization structure
    \param[in]  p_struct: init structure pointer
    \param[out] none
    \retval     none
*/
void hal_smartcard_struct_init(hal_smartcard_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1U == HAL_PARAMETER_CHECK)
    if(NULL == p_struct){
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    switch(hal_struct_type){
    case HAL_SMARTCARD_INIT_STRUCT:
        /* initialize smartcard initialization structure with the default values */
        ((hal_smartcard_init_struct*)p_struct)->baudrate = 115200U;
        ((hal_smartcard_init_struct*)p_struct)->parity = SMARTCARD_PARITY_EVEN;
        ((hal_smartcard_init_struct*)p_struct)->word_length = SMARTCARD_WORD_LENGTH_9BIT;
        ((hal_smartcard_init_struct*)p_struct)->stop_bit = SMARTCARD_STOP_BIT_1_5;
        ((hal_smartcard_init_struct*)p_struct)->direction = SMARTCARD_DIRECTION_RX_TX;
        ((hal_smartcard_init_struct*)p_struct)->clock_polarity = SMARTCARD_CLOCK_POLARITY_LOW;
        ((hal_smartcard_init_struct*)p_struct)->clock_phase = SMARTCARD_CLOCK_PHASE_1CK;
        ((hal_smartcard_init_struct*)p_struct)->clock_length_lastbit = SMARTCARD_LAST_BIT_NOT_OUTPUT;
        ((hal_smartcard_init_struct*)p_struct)->prescaler = 10U;
        ((hal_smartcard_init_struct*)p_struct)->guard_time = 0U;
        ((hal_smartcard_init_struct*)p_struct)->nack_state = SMARTCARD_NACK_ENABLE;
        ((hal_smartcard_init_struct*)p_struct)->timeout_enable = SMARTCARD_TIMEOUT_DISABLE;
        ((hal_smartcard_init_struct*)p_struct)->timeout_value = 0U;
        ((hal_smartcard_init_struct*)p_struct)->block_length = 0U;
        ((hal_smartcard_init_struct*)p_struct)->sample_method = SMARTCARD_THREE_SAMPLE_BIT;
        ((hal_smartcard_init_struct*)p_struct)->auto_retry_count = 0U;
        break;
    
    case HAL_SMARTCARD_INIT_EX_STRUCT:
        /* initialize smartcard extend initialization structure with the default values */
        ((hal_smartcard_init_ex_struct*)p_struct)->data_bit_invert = DISABLE;
        ((hal_smartcard_init_ex_struct*)p_struct)->first_bit_msb = DISABLE;
        ((hal_smartcard_init_ex_struct*)p_struct)->overrun_disable = DISABLE;
        ((hal_smartcard_init_ex_struct*)p_struct)->rx_error_dma_stop = DISABLE;
        ((hal_smartcard_init_ex_struct*)p_struct)->rx_level_invert = DISABLE;
        ((hal_smartcard_init_ex_struct*)p_struct)->tx_level_invert = DISABLE;
        ((hal_smartcard_init_ex_struct*)p_struct)->tx_rx_swap = DISABLE;
        break;

    case HAL_SMARTCARD_DEV_STRUCT:
        /* initialize smartcard device information structure with the default values */
        ((hal_smartcard_dev_struct*)p_struct)->periph = 0U;
        ((hal_smartcard_dev_struct*)p_struct)->smartcard_irq.error_handle = NULL;
        ((hal_smartcard_dev_struct*)p_struct)->smartcard_irq.receive_complete_handle = NULL;
        ((hal_smartcard_dev_struct*)p_struct)->smartcard_irq.transmit_complete_handle = NULL;
        ((hal_smartcard_dev_struct*)p_struct)->smartcard_irq.transmit_ready_handle = NULL;
        ((hal_smartcard_dev_struct*)p_struct)->p_dma_rx = NULL;
        ((hal_smartcard_dev_struct*)p_struct)->p_dma_tx = NULL;
        ((hal_smartcard_dev_struct*)p_struct)->txbuffer.buffer = NULL;
        ((hal_smartcard_dev_struct*)p_struct)->txbuffer.length = 0U;
        ((hal_smartcard_dev_struct*)p_struct)->txbuffer.pos = 0U;
        ((hal_smartcard_dev_struct*)p_struct)->rxbuffer.buffer = NULL;
        ((hal_smartcard_dev_struct*)p_struct)->rxbuffer.length = 0U;
        ((hal_smartcard_dev_struct*)p_struct)->rxbuffer.pos = 0U;
        ((hal_smartcard_dev_struct*)p_struct)->error_state = HAL_SMARTCARD_ERROR_NONE;
        ((hal_smartcard_dev_struct*)p_struct)->tx_state = SMARTCARD_STATE_FREE;
        ((hal_smartcard_dev_struct*)p_struct)->rx_state = SMARTCARD_STATE_FREE;
        ((hal_smartcard_dev_struct*)p_struct)->last_error = HAL_SMARTCARD_ERROR_NONE;
        ((hal_smartcard_dev_struct*)p_struct)->priv = NULL;
        break;

