SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_smartcard.c
    case HAL_SMARTCARD_USER_CALLBCAK_STRUCT:
        /* initialize user callback structure with the default values */
        ((hal_smartcard_user_callback_struct*)p_struct)->complete_func = NULL;
        ((hal_smartcard_user_callback_struct*)p_struct)->error_func = NULL;
        break;

    case HAL_SMARTCARD_IRQ_INIT_STRUCT:
        /* initialize interrupt callback structure with the default values */
        ((hal_smartcard_irq_struct*)p_struct)->error_handle = NULL;
        ((hal_smartcard_irq_struct*)p_struct)->receive_complete_handle = NULL;
        ((hal_smartcard_irq_struct*)p_struct)->transmit_complete_handle = NULL;
        ((hal_smartcard_irq_struct*)p_struct)->transmit_ready_handle = NULL;
        break;

    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize smartcard
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_deinit(hal_smartcard_dev_struct *smartcard)
{
    uint32_t periph;
    periph = smartcard->periph;

    if((USART0 == periph)){
        /* deinitialize the peripheral */
        usart_deinit(periph);
        /* initialize smartcard extend initialization structure */
        hal_smartcard_struct_init(HAL_SMARTCARD_DEV_STRUCT, smartcard);
        smartcard->periph = periph;
    }else{
        HAL_DEBUGE("parameter [smartcard->periph] value is invalid");
    }
}

/*!
    \brief      initialize smartcard
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USART is initialized
                    this parameter can only be USART0 for gd32e23x
    \param[in]  p_init: the initialization data needed to initialize smartcard
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_smartcard_init(hal_smartcard_dev_struct *smartcard, uint32_t periph, \
                           hal_smartcard_init_struct *p_init)
{
    uint32_t reg_temp;

#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer and p_init address */
    if((NULL == smartcard) || (NULL == p_init)){
        HAL_DEBUGE("pointer [smartcard] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check periph parameter */
    if(USART0 != periph){
        HAL_DEBUGE("parameter [periph] value is invalid"); 
        return HAL_ERR_VAL;
    }

    /* check periph value from smartcard device struct */
    if(0U != smartcard->periph){
        HAL_DEBUGI("periph value from smartcard device struct has been rewrite");
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    smartcard->periph = periph;

    /* disable the peripheral */
    usart_disable(periph);

    /* CTL0 register configure */
    reg_temp = USART_CTL0(periph);
    reg_temp &= ~(USART_CTL0_PM | USART_CTL0_PCEN | USART_CTL0_WL | USART_CTL0_OVSMOD | \
                  USART_CTL0_REN | USART_CTL0_TEN);
    reg_temp |= (p_init->direction | p_init->parity | p_init->word_length);
    USART_CTL0(periph) = reg_temp;

    /* CTL1 register configure */
    reg_temp = USART_CTL1(periph);
    reg_temp &= ~(USART_CTL1_RTEN | USART_CTL1_CLEN | USART_CTL1_CPH | USART_CTL1_CPL| \
                  USART_CTL1_CKEN | USART_CTL1_STB);
    /* Synchronous mode is activated by default */
    reg_temp |= (USART_CTL1_CKEN | p_init->clock_polarity | p_init->clock_phase | \
                p_init->clock_length_lastbit | p_init->timeout_enable | p_init->stop_bit);
    USART_CTL1(periph) = reg_temp;

    /* CTL2 register configure */
    reg_temp = USART_CTL2(periph);
    reg_temp &= ~(USART_CTL2_OSB | USART_CTL2_NKEN |USART_CTL2_SCRTNUM);
    reg_temp |= (p_init->sample_method | p_init->nack_state | (p_init->auto_retry_count << 17U));
    USART_CTL2(periph) = reg_temp;

    /* GP register configure */
    reg_temp = USART_GP(periph);
    reg_temp &= ~(USART_GP_PSC | USART_GP_GUAT);
    reg_temp |= ((p_init->guard_time << 8U) | p_init->prescaler);
    USART_GP(periph) = reg_temp;

    /* RT register configure */
    reg_temp = USART_RT(periph);
    reg_temp &= ~(USART_RT_RT | USART_RT_BL);
    reg_temp |= ((p_init->block_length << 24U));
    if(SMARTCARD_TIMEOUT_ENABLE == p_init->timeout_enable) {
        reg_temp |= p_init->timeout_value;
    }
    USART_RT(periph) = reg_temp;

    /* baud rate configure */
    usart_baudrate_set(periph, p_init->baudrate);

    /* clear LMEN, HDEN, IREN */
    usart_halfduplex_disable(periph);
    usart_irda_mode_disable(periph);
    usart_lin_mode_disable(periph);

    /* enable SMARTCARD */
    usart_smartcard_mode_enable(periph);

    /* initialize Tx and Rx state */
    smartcard->tx_state = SMARTCARD_STATE_FREE;
    smartcard->rx_state = SMARTCARD_STATE_FREE;

    return HAL_ERR_NONE;
}

/*!
    \brief      initialize extended smartcard
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USART is initialized
                    this parameter can only be USART0 for gd32e23x
    \param[in]  p_init: the extended initialization data needed to initialize smartcard
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, details refer to gd32e23x_hal.h
*/
int32_t hal_smartcard_init_ex(hal_smartcard_dev_struct *smartcard, uint32_t periph, \
                              hal_smartcard_init_ex_struct *p_init)
{
#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer and p_init address */
    if((NULL == smartcard) || (NULL == p_init)){
        HAL_DEBUGE("pointer [smartcard] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check periph parameter */
    if(USART0 != periph){
        HAL_DEBUGE("parameter [periph] value is invalid"); 
        return HAL_ERR_VAL;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    smartcard->periph = periph;

