SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_smartcard.c
    /* disable the peripheral */
    usart_disable(periph);

    /* configure data inversion */
    if(ENABLE == p_init->data_bit_invert){
        USART_CTL1(periph) |= USART_CTL1_DINV;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_DINV);
    }

    /* configure Rx pin active level inversion */
    if(ENABLE == p_init->rx_level_invert){
        USART_CTL1(periph) |= USART_CTL1_RINV;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_RINV);
    }

    /* configure Tx pin active level inversion */
    if(ENABLE == p_init->tx_level_invert){
        USART_CTL1(periph) |= USART_CTL1_TINV;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_TINV);
    }

    /* configure Rx/Tx pins swap */
    if(ENABLE == p_init->tx_rx_swap){
        USART_CTL1(periph) |= USART_CTL1_STRP;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_STRP);
    }

    /* configure MSB first on communication line */
    if(ENABLE == p_init->first_bit_msb){
        USART_CTL1(periph) |= USART_CTL1_MSBF;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_MSBF);
    }

    /* configure Rx overrun detection disabling */
    if(ENABLE == p_init->overrun_disable){
        USART_CTL2(periph) |= USART_CTL2_OVRD;
    }else{
        USART_CTL2(periph) &= ~(USART_CTL2_OVRD);
    }

    /* configure DMA disabling on reception error */
    if(ENABLE == p_init->rx_error_dma_stop){
        USART_CTL2(periph) |= USART_CTL2_DDRE;
    }else{
        USART_CTL2(periph) &= ~(USART_CTL2_DDRE);
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      smartcard interrupt handler content function
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_irq(hal_smartcard_dev_struct *smartcard)
{
    /* if no error occurs */
    if(RESET == _smartcard_error_flag_get(smartcard)){
        /* if USART is in receiver mode */
        if(RESET != usart_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_RBNE)){
            if(NULL != smartcard->smartcard_irq.receive_complete_handle){
                smartcard->smartcard_irq.receive_complete_handle(smartcard);
            }
            return;
        }

    /* if some errors occur */
    }else{
        /* smartcard parity error interrupt occurred */
        if(RESET != usart_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_PERR)){
            usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_PERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_PERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_PERR;
        }

        /* smartcard noise error interrupt occurred */
        if(RESET != usart_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_ERR_NERR)){
            usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_NERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_NERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_NERR;
        }

        /* smartcard frame error interrupt occurred */
        if(RESET != usart_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_ERR_FERR)){
            usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_FERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_FERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_FERR;
        }

        /* smartcard overrun interrupt occurred */
        if(RESET != usart_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_ERR_ORERR)){
            usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_ORERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_ORERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_ORERR;
        }

        /* smartcard read data buffer not empty and overrun error overrun interrupt occurred */
        if(RESET != usart_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_RBNE_ORERR)){
            usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_RBNE_ORERR);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_ORERR;
            smartcard->last_error = HAL_SMARTCARD_ERROR_ORERR;
        }

        /* smartcard receiver timeout interrupt occurred */
        if(RESET != usart_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_RT)){
            usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_RT);
            smartcard->error_state |= HAL_SMARTCARD_ERROR_RTF;
            smartcard->last_error = HAL_SMARTCARD_ERROR_RTF;
        }

        if(HAL_SMARTCARD_ERROR_NONE != smartcard->error_state){
            /* call error callback  */
            if(NULL != smartcard->smartcard_irq.error_handle){
                smartcard->smartcard_irq.error_handle(smartcard);
                smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;
            }
            return;
        }
    }

    /* transmitter buffer empty interrupt handle */
    if(RESET != usart_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_TBE)){
        if(smartcard->smartcard_irq.transmit_ready_handle != NULL){
            smartcard->smartcard_irq.transmit_ready_handle(smartcard);
        }

        return;
    }

    /* transmission complete interrupt handle */
    if(RESET != usart_interrupt_flag_get(smartcard->periph, USART_INT_FLAG_TC)){
        usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_TC);

        if(NULL != smartcard->smartcard_irq.transmit_complete_handle){
            smartcard->smartcard_irq.transmit_complete_handle(smartcard);
        }

        return;
    }
}

/*!
    \brief      start smartcard module
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_start(hal_smartcard_dev_struct *smartcard)
{
    usart_enable(smartcard->periph);
}

/*!
    \brief      stop smartcard module
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_stop(hal_smartcard_dev_struct *smartcard)
{
    usart_disable(smartcard->periph);
}

/*!
    \brief      set user-defined interrupt callback function
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_irq: smartcard interrupt callback function pointer
    \param[out] none
    \retval     none
*/
void hal_smartcard_irq_handle_set(hal_smartcard_dev_struct *smartcard, hal_smartcard_irq_struct *p_irq)
{
    /* initialize smartcard error callback */
    if(NULL != p_irq->error_handle){
        smartcard->smartcard_irq.error_handle = p_irq->error_handle;
        usart_interrupt_enable(smartcard->periph, USART_INT_ERR);
        usart_interrupt_enable(smartcard->periph, USART_INT_PERR);
    }else{
        smartcard->smartcard_irq.error_handle = NULL;
        usart_interrupt_disable(smartcard->periph, USART_INT_ERR);
        usart_interrupt_disable(smartcard->periph, USART_INT_PERR);
    }

    /* initialize smartcard receive completed callback */
    if(NULL != p_irq->receive_complete_handle){
        smartcard->smartcard_irq.receive_complete_handle = p_irq->receive_complete_handle;
        usart_interrupt_enable(smartcard->periph, USART_INT_RBNE);
    }else{
        smartcard->smartcard_irq.receive_complete_handle = NULL;
        usart_interrupt_disable(smartcard->periph, USART_INT_RBNE);
    }

    /* initialize smartcard transmit completed callback */
    if(NULL != p_irq->transmit_complete_handle){
        smartcard->smartcard_irq.transmit_complete_handle = p_irq->transmit_complete_handle;
        usart_interrupt_enable(smartcard->periph, USART_INT_TC);
    }else{
        smartcard->smartcard_irq.transmit_complete_handle = NULL;
        usart_interrupt_disable(smartcard->periph, USART_INT_TC);
    }

    /* initialize smartcard transmit ready callback */
    if(NULL != p_irq->transmit_ready_handle){
        smartcard->smartcard_irq.transmit_ready_handle = p_irq->transmit_ready_handle;
        usart_interrupt_enable(smartcard->periph, USART_INT_TBE);
    }else{
        smartcard->smartcard_irq.transmit_ready_handle = NULL;
        usart_interrupt_disable(smartcard->periph, USART_INT_TBE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_irq_handle_all_reset(hal_smartcard_dev_struct *smartcard)
{
    /* configure interrupt callback function to NULL */
    smartcard->smartcard_irq.error_handle = NULL;
    smartcard->smartcard_irq.receive_complete_handle = NULL;
    smartcard->smartcard_irq.transmit_complete_handle = NULL;
    smartcard->smartcard_irq.transmit_ready_handle = NULL;
}

/*!
    \brief      transmit amounts of data by poll method
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
*/
int32_t hal_smartcard_transmit_poll(hal_smartcard_dev_struct *smartcard, void *p_buffer, \
                                    uint32_t length, uint32_t timeout_ms)
{
    uint32_t tick_start;

#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer, p_buffer address and length */
    if((NULL == smartcard) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* check whether the Tx state is in ready */
    if(SMARTCARD_STATE_BUSY == smartcard->tx_state){
        HAL_DEBUGE("usart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* disable receive and enable transmit */
    usart_receive_config(smartcard->periph, USART_RECEIVE_DISABLE);
    usart_command_enable(smartcard->periph, USART_CMD_RXFCMD);
    usart_transmit_config(smartcard->periph, USART_TRANSMIT_ENABLE);

    /* initialize transmit parameter */
    smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;
    smartcard->txbuffer.buffer = (uint8_t *)p_buffer; 
    smartcard->txbuffer.length = length;
    smartcard->txbuffer.pos = 0U;
    smartcard->tx_state = SMARTCARD_STATE_BUSY;

    /* configure timeout */
    tick_start = hal_basetick_count_get();

    while(smartcard->txbuffer.pos < length){
        /* wait for transmit buffer empty */
        while(RESET == usart_flag_get(smartcard->periph, USART_FLAG_TBE)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("smartcard transmit timeout");
                    smartcard->tx_state = SMARTCARD_STATE_FREE;
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* write the data to be transmitted */
        usart_data_transmit(smartcard->periph, (*smartcard->txbuffer.buffer & (uint8_t)0xFFU));
        smartcard->txbuffer.buffer++;

        /* change the transmit pointer */
        smartcard->txbuffer.pos++;
    }

    /* wait for transmit complete */
    while(RESET == usart_flag_get(smartcard->periph, USART_FLAG_TC)){
        if(HAL_TIMEOUT_FOREVER != timeout_ms){
            if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                HAL_DEBUGW("smartcard transmit timeout");
                smartcard->tx_state = SMARTCARD_STATE_FREE;
                return HAL_ERR_TIMEOUT;
            }
        }
    }

