SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_smartcard.c
    /* re-enable receive */
    usart_receive_config(smartcard->periph, USART_RECEIVE_ENABLE);

    /* change the Tx state to free */
    smartcard->tx_state = SMARTCARD_STATE_FREE;

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by poll method
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
*/
int32_t hal_smartcard_receive_poll(hal_smartcard_dev_struct *smartcard, void *p_buffer, \
                                   uint32_t length, uint32_t timeout_ms)
{
    uint32_t tick_start;

#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer, p_buffer address and length */
    if((NULL == smartcard) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* check whether the Rx state is in ready */
    if(SMARTCARD_STATE_BUSY == smartcard->rx_state){
        HAL_DEBUGE("usart rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* initialize receive parameter */
    smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;
    smartcard->rxbuffer.buffer = (uint8_t *)p_buffer; 
    smartcard->rxbuffer.length = length;
    smartcard->rxbuffer.pos = 0U;
    smartcard->rx_state = SMARTCARD_STATE_BUSY;

    /* configure timeout */
    tick_start = hal_basetick_count_get();

    while(smartcard->rxbuffer.pos < length){
        /* wait for read data buffer not empty */
        while(RESET == usart_flag_get(smartcard->periph, USART_FLAG_RBNE)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("usart receive timeout");
                    smartcard->rx_state = SMARTCARD_STATE_FREE;
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* read data from data register */
        *smartcard->rxbuffer.buffer = (uint8_t)(usart_data_receive(smartcard->periph) & 0xFFU);
        smartcard->rxbuffer.buffer++;

        /* change the receive pointer */
        smartcard->rxbuffer.pos++;
    }

    /* change the Rx state to free */
    smartcard->rx_state = SMARTCARD_STATE_FREE;

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by interrupt method
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, details refer to gd32e23x_hal.h
*/
int32_t hal_smartcard_transmit_interrupt(hal_smartcard_dev_struct *smartcard, void *p_buffer, \
                                         uint32_t length, hal_smartcard_user_cb p_user_func)
{
#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer, p_buffer address and length */
    if((NULL == smartcard) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* check whether the Tx state is in ready */
    if(SMARTCARD_STATE_BUSY == smartcard->tx_state){
        HAL_DEBUGE("usart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* disable receive and enable transmit */
    usart_receive_config(smartcard->periph, USART_RECEIVE_DISABLE);
    usart_command_enable(smartcard->periph, USART_CMD_RXFCMD);
    usart_transmit_config(smartcard->periph, USART_TRANSMIT_ENABLE);

    /* initialize transmit parameter */
    smartcard->tx_state = SMARTCARD_STATE_BUSY;
    smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;
    smartcard->txbuffer.buffer = (uint8_t *)p_buffer; 
    smartcard->txbuffer.length = length;
    smartcard->txbuffer.pos = 0U;
    smartcard->tx_callback = (void *)p_user_func;
    smartcard->smartcard_irq.transmit_ready_handle = _smartcard_transmit_interrupt;
    smartcard->smartcard_irq.transmit_complete_handle = _smartcard_transmit_complete_interrupt;

    /* clear USART TC interrupt flag */
    usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_TC);

    /* enable ERR(frame error) and TBE interrupt */
    usart_interrupt_enable(smartcard->periph, USART_INT_ERR);
    usart_interrupt_enable(smartcard->periph, USART_INT_TBE);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by interrupt method 
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be sent received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, details refer to gd32e23x_hal.h
*/
int32_t hal_smartcard_receive_interrupt(hal_smartcard_dev_struct *smartcard, void *p_buffer, \
                                        uint32_t length, hal_smartcard_user_cb p_user_func)
{
#if (1U == HAL_PARAMETER_CHECK)
    /* check smartcard pointer, p_buffer address and length */
    if((NULL == smartcard) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [usart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* check whether the Rx state is in ready */
    if(SMARTCARD_STATE_BUSY == smartcard->rx_state){
        HAL_DEBUGE("usart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

