SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_smartcard.c
    /* initialize receive parameter */
    smartcard->rx_state = SMARTCARD_STATE_BUSY;
    smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;
    smartcard->rxbuffer.buffer = (uint8_t *)p_buffer;
    smartcard->rxbuffer.length = length;
    smartcard->rxbuffer.pos = 0U;
    if(NULL != p_user_func){
        smartcard->rx_callback = (void *)p_user_func->complete_func;
        smartcard->smartcard_irq.error_handle = (hal_irq_handle_cb)p_user_func->error_func;
    }else{
        smartcard->rx_callback = NULL;
        smartcard->smartcard_irq.error_handle = NULL;
    }

    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _smartcard_receive_dma;
    dma_irq.error_handle = _smartcard_dma_error;
    if(NULL != smartcard->p_dma_rx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = smartcard->p_dma_rx->dma_irq.half_finish_handle;
    }

    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(smartcard->p_dma_rx, (smartcard->periph + 0x24U), \
                           (uint32_t)smartcard->rxbuffer.buffer, length, &dma_irq);

    /* clear DMA global interrupt flag */
    dma_flag_clear(smartcard->p_dma_tx->channel, DMA_FLAG_G);

    /* enable the usart parity error interrupt */
    usart_interrupt_enable(smartcard->periph, USART_INT_PERR);

    /* enable the usart error interrupt: (frame error, noise error, overrun error) */
    usart_interrupt_enable(smartcard->periph, USART_INT_ERR);

    /* DMA enable for smartcard reception */
    usart_dma_receive_config(smartcard->periph, USART_DENR_ENABLE);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop smartcard transmit transfer
                the function is blocking
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_smartcard_transmit_stop(hal_smartcard_dev_struct *smartcard)
{
#if (1U == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == smartcard){
        HAL_DEBUGE("parameter [smartcard] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* disable the TBE and TC interrupt */
    usart_interrupt_disable(smartcard->periph, USART_INT_TBE);
    usart_interrupt_disable(smartcard->periph, USART_INT_TC);

    /* check receive state, if free then disable ERR interrupt */
    if(SMARTCARD_STATE_FREE == smartcard->rx_state){
        usart_interrupt_disable(smartcard->periph, USART_INT_ERR);
    }

    /* disable DMA transimt and stop DMA */
    usart_dma_transmit_config(smartcard->periph, USART_DENT_DISABLE);
    hal_dma_stop(smartcard->p_dma_tx);

    /* reset the position and state */
    smartcard->txbuffer.pos = 0U;
    smartcard->tx_state = SMARTCARD_STATE_FREE;

    /* clear interrupt error flags */
    usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_FERR);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop smartcard receive transfer
                the function is blocking
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_smartcard_receive_stop(hal_smartcard_dev_struct *smartcard)
{
#if (1U == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == smartcard){
        HAL_DEBUGE("parameter [smartcard] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1U == HAL_PARAMETER_CHECK */

    /* disable the RBNE, PERR, ERR, EB and RT interrupt */
    usart_interrupt_disable(smartcard->periph, USART_INT_RBNE);
    usart_interrupt_disable(smartcard->periph, USART_INT_PERR);
    usart_interrupt_disable(smartcard->periph, USART_INT_EB);
    usart_interrupt_disable(smartcard->periph, USART_INT_RT);

    /* check transmit state, if free then disable ERR interrupt */
    if(SMARTCARD_STATE_FREE == smartcard->tx_state){
        usart_interrupt_disable(smartcard->periph, USART_INT_ERR);
    }

    /* disable DMA receive and stop DMA */
    usart_dma_receive_config(smartcard->periph, USART_DENR_DISABLE);
    hal_dma_stop(smartcard->p_dma_rx);

    /* reset the position and state */
    smartcard->rxbuffer.pos = 0U;
    smartcard->rx_state = SMARTCARD_STATE_FREE;

    /* clear interrupt error flags */
    usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_PERR);
    usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_FERR);
    usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_NERR);
    usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_ERR_ORERR);
    usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_EB);
    usart_interrupt_flag_clear(smartcard->periph, USART_INT_FLAG_RT);

    return HAL_ERR_NONE;
}

/*!
    \brief      dynamic update the smartcard block length
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  block_length: 0x00000000-0x000000FF
    \param[out] none
    \retval     none
*/
void hal_smartcard_block_length_set(hal_smartcard_dev_struct *smartcard, uint32_t block_length)
{
    USART_RT(smartcard->periph) &= ~(USART_RT_BL);
    USART_RT(smartcard->periph) |= (USART_RT_BL & ((block_length) << 24U));
}

/*!
    \brief      dynamic update the smartcard receiver timeout value
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  rtimeout: 0x00000000-0x00FFFFFF, receiver timeout value in terms of number of baud clocks
    \param[out] none
    \retval     none
*/
void hal_smartcard_receiver_timeout_set(hal_smartcard_dev_struct *smartcard, uint32_t rtimeout)
{
    USART_RT(smartcard->periph) &= ~(USART_RT_RT);
    USART_RT(smartcard->periph) |= rtimeout;
}

/*!
    \brief      enable the smartcard receiver timeout
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_receiver_timeout_enable(hal_smartcard_dev_struct *smartcard)
{
    USART_CTL1(smartcard->periph) |= USART_CTL1_RTEN;
}

/*!
    \brief      disable the smartcard receiver timeout
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_smartcard_receiver_timeout_disable(hal_smartcard_dev_struct *smartcard)
{
    USART_CTL1(smartcard->periph) &= ~(USART_CTL1_RTEN);
}

/*!
    \brief      get smartcard error status
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error status: RESET or SET
*/
static FlagStatus _smartcard_error_flag_get(hal_smartcard_dev_struct *smartcard)
{
    if(0U == (USART_STAT(smartcard->periph) & (uint32_t)(USART_STAT_PERR | USART_STAT_FERR | \
             USART_STAT_ORERR | USART_STAT_NERR | USART_STAT_RTF))){
        return RESET;
    }else{
        return SET;
    }
}

/*!
    \brief      smartcard transmit complete interrupt handler
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _smartcard_transmit_complete_interrupt(void *smartcard)
{
    hal_smartcard_dev_struct *p_smartcard = smartcard;
    hal_smartcard_user_cb p_func = (hal_smartcard_user_cb)p_smartcard->tx_callback;

    /* disable usart transmit complete interrupt */
    usart_interrupt_disable(p_smartcard->periph, USART_INT_TC);

