SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_smartcard.c
    /* check receive state, if free then disable ERR interrupt */
    if(SMARTCARD_STATE_FREE == p_smartcard->rx_state){
        usart_interrupt_disable(p_smartcard->periph, USART_INT_ERR);
    }

    /* clear transmit complete callback pointer */
    p_smartcard->smartcard_irq.transmit_complete_handle = NULL;

    /* re-enable receive */
    usart_receive_config(p_smartcard->periph, USART_RECEIVE_ENABLE);

    /* change the Tx state to free */
    p_smartcard->tx_state = SMARTCARD_STATE_FREE;

    if(NULL != p_func){
        p_func(p_smartcard);
    }
}

/*!
    \brief      smartcard transmit interrupt handler
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _smartcard_transmit_interrupt(void *smartcard)
{
    hal_smartcard_dev_struct *p_smartcard = smartcard;
    uint32_t length = p_smartcard->txbuffer.length;

    /* Check the remain data to be transmitted */
    if(p_smartcard->txbuffer.pos < length){
        usart_data_transmit(p_smartcard->periph, (*p_smartcard->txbuffer.buffer & (uint8_t)0xFFU));
        p_smartcard->txbuffer.buffer++;
        p_smartcard->txbuffer.pos++;
    }else{
        /* disable TBE interrupt and enable TC interrupt */
        usart_interrupt_disable(p_smartcard->periph, USART_INT_TBE);
        usart_interrupt_enable(p_smartcard->periph, USART_INT_TC);

        p_smartcard->smartcard_irq.transmit_ready_handle = NULL;
    }
}

/*!
    \brief      smartcard receive interrupt handler
    \param[in]  smartcard: smartcard device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _smartcard_receive_interrupt(void *smartcard)
{
    hal_smartcard_dev_struct *p_smartcard = smartcard;
    uint32_t length = p_smartcard->rxbuffer.length;

    /* read data from data register */
    *p_smartcard->rxbuffer.buffer = (uint8_t)(usart_data_receive(p_smartcard->periph) & 0xFFU);
    p_smartcard->rxbuffer.buffer++;
    p_smartcard->rxbuffer.pos++;

    if(p_smartcard->rxbuffer.pos == length){
        hal_smartcard_user_cb p_func = (hal_smartcard_user_cb)p_smartcard->rx_callback;

        /* disable PERR and RBNE interrupt */
        usart_interrupt_disable(p_smartcard->periph, USART_INT_PERR);
        usart_interrupt_disable(p_smartcard->periph, USART_INT_RBNE);

        /* check transmit state, if free then disable ERR interrupt */
        if(SMARTCARD_STATE_FREE == p_smartcard->tx_state){
            usart_interrupt_disable(p_smartcard->periph, USART_INT_ERR);
        }

        /* reset receive_complete_handle */
        p_smartcard->smartcard_irq.receive_complete_handle = NULL;

        /* change the Rx state to free */
        p_smartcard->rx_state = SMARTCARD_STATE_FREE;

        if(NULL != p_func){
            p_func(p_smartcard);
        }
    }
}

/*!
    \brief      smartcard DMA transmit handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _smartcard_transmit_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_smartcard_dev_struct *p_smartcard;

    p_dma = (hal_dma_dev_struct*)dma;
    p_smartcard = (hal_smartcard_dev_struct*)p_dma->p_periph;

    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)){
        p_smartcard->txbuffer.pos = p_smartcard->txbuffer.length;

        /* disable the dma transfer for transmit request */
        usart_dma_transmit_config(p_smartcard->periph, USART_DENT_DISABLE);

        /* enable TC interrupt */
        usart_interrupt_enable(p_smartcard->periph, USART_INT_TC);
    }
}

/*!
    \brief      smartcard DMA receive handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _smartcard_receive_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_smartcard_dev_struct *p_smartcard;
    hal_smartcard_user_cb p_func;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_smartcard = (hal_smartcard_dev_struct*)p_dma->p_periph;
    p_func = (hal_smartcard_user_cb)p_smartcard->rx_callback;

    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)){
        p_smartcard->rxbuffer.pos = p_smartcard->rxbuffer.length;

        /* disable the dma transfer for the receiver request */
        usart_dma_receive_config(p_smartcard->periph, USART_DENR_DISABLE);

        /* disable PERR and ERR(frame error, noise error, overrun error) interrupts */
        usart_interrupt_disable(p_smartcard->periph, USART_INT_PERR);
        usart_interrupt_disable(p_smartcard->periph, USART_INT_ERR);

        /* change the Rx state to free */
        p_smartcard->rx_state = SMARTCARD_STATE_FREE;
    }

    if(NULL != p_func){
        p_func(p_smartcard);
    }
}

/*!
    \brief      smartcard dma communication error
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _smartcard_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_smartcard_dev_struct *p_smartcard;

    p_dma = (hal_dma_dev_struct*)dma;
    p_smartcard = (hal_smartcard_dev_struct*)p_dma->p_periph;

    if(SMARTCARD_STATE_BUSY == p_smartcard->tx_state){
        p_smartcard->error_state |= HAL_SMARTCARD_ERROR_DMATX;
        p_smartcard->last_error = HAL_SMARTCARD_ERROR_DMATX;
        p_smartcard->txbuffer.pos = p_smartcard->txbuffer.length;

        /* disable the dma transmit */
        usart_dma_transmit_config(p_smartcard->periph, USART_DENT_DISABLE);

        /* disable and ERR(frame error) interrupt */
        usart_interrupt_disable(p_smartcard->periph, USART_INT_ERR);

        /* change the Tx state to free */
        p_smartcard->tx_state = SMARTCARD_STATE_FREE;
    }else if(SMARTCARD_STATE_BUSY == p_smartcard->rx_state){
        p_smartcard->error_state |= HAL_SMARTCARD_ERROR_DMARX;
        p_smartcard->last_error = HAL_SMARTCARD_ERROR_DMARX;
        p_smartcard->rxbuffer.pos = p_smartcard->rxbuffer.length;

        /* disable the dma receive */
        usart_dma_receive_config(p_smartcard->periph, USART_DENR_DISABLE);

        /* disable PERR and ERR(frame error, noise error, overrun error) interrupts */
        usart_interrupt_disable(p_smartcard->periph, USART_INT_PERR);
        usart_interrupt_disable(p_smartcard->periph, USART_INT_ERR);

        /* change the Rx state to free */
        p_smartcard->rx_state = SMARTCARD_STATE_FREE;
    }else{
        HAL_DEBUGE("smartcard processor fatal error: dma error exception due to run state");
    }

    if(p_smartcard->smartcard_irq.error_handle != NULL){
        p_smartcard->smartcard_irq.error_handle(p_smartcard);

        /* change the error state to none */
        p_smartcard->error_state = HAL_SMARTCARD_ERROR_NONE;
    }
}
